import 'package:places/domain/sight.dart';

// Заглушка с тестовыми данными
final List mocks = [
  Sight(
    'Пряности и радости',
    59.958406,
    30.321156,
    'https://ginza.ru/spb',
    'На двух этажах «Пряностей» нарядно и по-домашнему. Уютно и тепло во всех залах: и в крытой мансарде среди разноцветных стульев под вьющейся зеленью, и в каминном зале, где от пола до потолка шкафы ломятся от вина, и в большом зале, где в канареечных горшках расселись фикусы, а в нишах поместились важные синие попугаи.',
    'ресторан',
  ),
  Sight(
    'Наутилус Инн',
    59.922061,
    30.416886,
    'https://www.nautilus-inn.ru/',
    'Этот 3-звездочный отель находится в центре Санкт-Петербурга, всего в 10 минутах езды от Невского проспекта. К услугам гостей ресторан, оформленный в морском стиле, тренажерный зал и салон красоты.',
    'отель',
  ),
  Sight(
    'Музей железных дорог России',
    59.905666,
    30.297802,
    'https://rzd-museum.ru/',
    'Наш музейный комплекс — главный железнодорожный музей России и один из крупнейших музеев железных дорог в мире. Торжественное открытие, приуроченное к 180-летию железных дорог России, состоялось 30 октября 2017 года.',
    'музей',
  ),
  Sight(
    'Летний сад',
    59.950482,
    30.348966,
    'https://rusmuseum.ru/summer-garden/',
    'Летний сад — любимое детище Петра I, жемчужина в парковом ожерелье Петербурга.',
    'особое место',
  ),
];
