import 'package:places/domain/sight.dart';

// Заглушка с тестовыми данными
final List mocks = [
  Sight(
    name: 'Пряности и радости',
    lat: 59.958406,
    lon: 30.321156,
    url: 'https://ginza.ru/spb',
    detail:
        'На двух этажах «Пряностей» нарядно и по-домашнему. Уютно и тепло во всех залах: и в крытой мансарде среди разноцветных стульев под вьющейся зеленью, и в каминном зале, где от пола до потолка шкафы ломятся от вина, и в большом зале, где в канареечных горшках расселись фикусы, а в нишах поместились важные синие попугаи.',
    type: 'ресторан',
  ),
  Sight(
    name: 'Наутилус Инн',
    lat: 59.922061,
    lon: 30.416886,
    url: 'https://www.nautilus-inn.ru/',
    detail:
        'Этот 3-звездочный отель находится в центре Санкт-Петербурга, всего в 10 минутах езды от Невского проспекта. К услугам гостей ресторан, оформленный в морском стиле, тренажерный зал и салон красоты.',
    type: 'отель',
  ),
  Sight(
    name: 'Музей железных дорог России',
    lat: 59.905666,
    lon: 30.297802,
    url: 'https://rzd-museum.ru/',
    detail:
        'Наш музейный комплекс — главный железнодорожный музей России и один из крупнейших музеев железных дорог в мире. Торжественное открытие, приуроченное к 180-летию железных дорог России, состоялось 30 октября 2017 года.',
    type: 'музей',
  ),
  Sight(
    name: 'Летний сад',
    lat: 59.950482,
    lon: 30.348966,
    url: 'https://rusmuseum.ru/summer-garden/',
    detail:
        'Летний сад — любимое детище Петра I, жемчужина в парковом ожерелье Петербурга.',
    type: 'особое место',
  ),
];
